In [2]:
import pandas as pd
import seaborn as sns

In [ ]:
df = pd.read_csv('tips.csv')
df.head()
#offline

In [3]:
df = sns.load_dataset('tips')
df.head()
#online

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [5]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [8]:
type(df['total_bill'])

pandas.core.series.Series

In [16]:
df[['total_bill']]
# df

     total_bill
0         16.99
1         10.34
2         21.01
3         23.68
4         24.59
..          ...
239       29.03
240       27.18
241       22.67
242       17.82
243       18.78

[244 rows x 1 columns]

In [23]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [30]:
df.loc[0:4,['total_bill','tip']]

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61

In [34]:
df.iloc[0:4,0:2]

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31

In [35]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [42]:
df2 = df.loc[242:,['time','size']]
df2

       time  size
242  Dinner     2
243  Dinner     2

In [44]:
df2.loc[243]

time    Dinner
size         2
Name: 243, dtype: object

In [48]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [47]:
df['total_bill'].min()

3.07

In [49]:
df['total_bill'].max()

50.81

In [50]:
df['total_bill'].mean()

19.78594262295082

In [51]:
df['total_bill'].sum()

4827.77

In [54]:
df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [58]:
list(df['time'].value_counts().index)

['Dinner', 'Lunch']

In [61]:
list(df['time'].value_counts().values)

[176, 68]

In [62]:
df.shape

(244, 7)

In [63]:
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [65]:
df['smoker'].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [73]:
df[(df['smoker'] == 'No') & (df['day'] == 'Sun')].shape

(57, 7)

In [78]:
# df.head()

# <=5   total_bill
# yes   smoker
# dinner time

# df['total_bill']<=5
# df['smoker'] == "Yes"
# df['time'] == "Dinner"
df[(df['total_bill'] <= 5) & (df['smoker'] == "Yes") & (df['time'] == "Dinner")][['total_bill','tip']]

    total_bill  tip
67        3.07  1.0

In [81]:
df2 = df[(df['total_bill'] <= 25) & (df['smoker'] == "Yes") ][['total_bill','tip']]
df2

     total_bill   tip
58        11.24  1.76
60        20.29  3.21
61        13.81  2.00
62        11.02  1.98
63        18.29  3.76
..          ...   ...
230       24.01  2.00
231       15.69  3.00
234       15.53  3.00
236       12.60  1.00
241       22.67  2.00

[65 rows x 2 columns]

In [83]:
df2.to_csv('filter_data.csv',index=False)

In [84]:
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [91]:
df['total_bill']   =   df['total_bill'].astype('int')

In [92]:
df.dtypes

total_bill       int32
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [99]:
df['size'].astype('O')

0      2
1      3
2      3
3      2
4      4
      ..
239    3
240    2
241    2
242    2
243    2
Name: size, Length: 244, dtype: object

In [102]:
df.sort_values(by='total_bill',ascending=False)

     total_bill    tip     sex smoker   day    time  size
170          50  10.00    Male    Yes   Sat  Dinner     3
59           48   6.73    Male     No   Sat  Dinner     4
212          48   9.00    Male     No   Sat  Dinner     4
156          48   5.00    Male     No   Sun  Dinner     6
182          45   3.50    Male    Yes   Sun  Dinner     3
..          ...    ...     ...    ...   ...     ...   ...
172           7   5.15    Male    Yes   Sun  Dinner     2
195           7   1.44    Male     No  Thur   Lunch     2
149           7   2.00    Male     No  Thur   Lunch     2
92            5   1.00  Female    Yes   Fri  Dinner     2
67            3   1.00  Female    Yes   Sat  Dinner     1

[244 rows x 7 columns]

In [104]:
df['smoker'].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [105]:
d = {"No":0,"Yes":1}
d

{'No': 0, 'Yes': 1}

In [109]:
# df['smoker']

In [110]:
df['smoker']   =  df['smoker'].map(d)

In [111]:
df

     total_bill   tip     sex smoker   day    time  size
0            16  1.01  Female      0   Sun  Dinner     2
1            10  1.66    Male      0   Sun  Dinner     3
2            21  3.50    Male      0   Sun  Dinner     3
3            23  3.31    Male      0   Sun  Dinner     2
4            24  3.61  Female      0   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239          29  5.92    Male      0   Sat  Dinner     3
240          27  2.00  Female      1   Sat  Dinner     2
241          22  2.00    Male      1   Sat  Dinner     2
242          17  1.75    Male      0   Sat  Dinner     2
243          18  3.00  Female      0  Thur  Dinner     2

[244 rows x 7 columns]